---
kind: method
id: M:Autodesk.Revit.DB.RadialArray.GetOriginalMemberIds
source: html/463da165-3dc6-315a-d2d7-95118d32445a.htm
---
# Autodesk.Revit.DB.RadialArray.GetOriginalMemberIds Method

Retrieves the original member Ids of the Array.

## Syntax (C#)
```csharp
public override ICollection<ElementId> GetOriginalMemberIds()
```

## Returns
The original member Ids of the Array